[Killed] BlockStatement
src/domain/balances.ts:3:78
 import type { Group, Expense, Balances, ExpenseSplit } from './types';
 
-export function computeBalances(group: Group, expenses: Expense[]): Balances {
-  const balances: Balances = {};
-
-  for (const member of group.members) {
-    balances[member.id] = 0;
-  }
-
-  for (const expense of expenses) {
-    credit(balances, expense.paidBy, expense.amount);
-    debitSplit(balances, expense.amount, expense.split);
-  }
-
-  return balances;
-}
+export function computeBalances(group: Group, expenses: Expense[]): Balances {}
 
 function credit(balances: Balances, memberId: string, amount: number): void {
killedBy: computeBalances sans dépenses initialise tous les membres à 0 quand il n'y a aucune dépense
statusReason: expected undefined to deeply equal { alice: +0, bob: +0, charlie: +0 }

[Killed] BlockStatement
src/domain/balances.ts:6:39
 export function computeBalances(group: Group, expenses: Expense[]): Balances {
   const balances: Balances = {};
 
-  for (const member of group.members) {
-    balances[member.id] = 0;
-  }
+  for (const member of group.members) {}
 
   for (const expense of expenses) {
killedBy: computeBalances sans dépenses initialise tous les membres à 0 quand il n'y a aucune dépense
statusReason: expected {} to deeply equal { alice: +0, bob: +0, charlie: +0 }

[Killed] BlockStatement
src/domain/balances.ts:10:35
     balances[member.id] = 0;
   }
 
-  for (const expense of expenses) {
-    credit(balances, expense.paidBy, expense.amount);
-    debitSplit(balances, expense.amount, expense.split);
-  }
+  for (const expense of expenses) {}
 
   return balances;
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected +0 to be close to 20, received difference is 20, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:18:77
   return balances;
 }
 
-function credit(balances: Balances, memberId: string, amount: number): void {
-  balances[memberId] = (balances[memberId] ?? 0) + amount;
-}
+function credit(balances: Balances, memberId: string, amount: number): void {}
 
 function debit(balances: Balances, memberId: string, amount: number): void {
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected -10 to be close to 20, received difference is 30, but expected 0.000005

[Killed] LogicalOperator
src/domain/balances.ts:19:25
 }
 
 function credit(balances: Balances, memberId: string, amount: number): void {
-  balances[memberId] = (balances[memberId] ?? 0) + amount;
+  balances[memberId] = (balances[memberId] && 0) + amount;
 }
 
killedBy: computeBalances plusieurs dépenses cas 4 — cumul de deux dépenses equal qui se compensent partiellement
statusReason: expected 20 to be close to 10, received difference is 10, but expected 0.000005

[Killed] ArithmeticOperator
src/domain/balances.ts:19:24
 }
 
 function credit(balances: Balances, memberId: string, amount: number): void {
-  balances[memberId] = (balances[memberId] ?? 0) + amount;
+  balances[memberId] = (balances[memberId] ?? 0) - amount;
 }
 
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected -40 to be close to 20, received difference is 60, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:22:76
   balances[memberId] = (balances[memberId] ?? 0) + amount;
 }
 
-function debit(balances: Balances, memberId: string, amount: number): void {
-  balances[memberId] = (balances[memberId] ?? 0) - amount;
-}
+function debit(balances: Balances, memberId: string, amount: number): void {}
 
 function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected 30 to be close to 20, received difference is 10, but expected 0.000005

[Killed] LogicalOperator
src/domain/balances.ts:23:25
 }
 
 function debit(balances: Balances, memberId: string, amount: number): void {
-  balances[memberId] = (balances[memberId] ?? 0) - amount;
+  balances[memberId] = (balances[memberId] && 0) - amount;
 }
 
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected -10 to be close to 20, received difference is 30, but expected 0.000005

[Killed] ArithmeticOperator
src/domain/balances.ts:23:24
 }
 
 function debit(balances: Balances, memberId: string, amount: number): void {
-  balances[memberId] = (balances[memberId] ?? 0) - amount;
+  balances[memberId] = (balances[memberId] ?? 0) + amount;
 }
 
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected 40 to be close to 20, received difference is 20, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:26:84
   balances[memberId] = (balances[memberId] ?? 0) - amount;
 }
 
-function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {
-  if (split.mode === 'equal') {
-    if (split.beneficiaries.length === 0) return;
-    const share = amount / split.beneficiaries.length;
-    for (const id of split.beneficiaries) {
-      debit(balances, id, share);
-    }
-    return;
-  }
-
-  if (split.mode === 'weighted') {
-    const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
-    if (totalWeight === 0) return;
-    for (const [id, weight] of Object.entries(split.weights)) {
-      debit(balances, id, (amount * weight) / totalWeight);
-    }
-    return;
-  }
-
-  for (const [id, pct] of Object.entries(split.percentages)) {
-    debit(balances, id, (amount * pct) / 100);
-  }
-}
+function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {}
 
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected 30 to be close to 20, received difference is 10, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:27:31
 }
 
 function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {
-  if (split.mode === 'equal') {
-    if (split.beneficiaries.length === 0) return;
-    const share = amount / split.beneficiaries.length;
-    for (const id of split.beneficiaries) {
-      debit(balances, id, share);
-    }
-    return;
-  }
+  if (split.mode === 'equal') {}
 
   if (split.mode === 'weighted') {
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/domain/balances.ts:27:7
 }
 
 function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {
-  if (split.mode === 'equal') {
+  if (true) {
     if (split.beneficiaries.length === 0) return;
     const share = amount / split.beneficiaries.length;
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/domain/balances.ts:28:9
 
 function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {
   if (split.mode === 'equal') {
-    if (split.beneficiaries.length === 0) return;
+    if (true) return;
     const share = amount / split.beneficiaries.length;
     for (const id of split.beneficiaries) {
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected 30 to be close to 20, received difference is 10, but expected 0.000005

[Killed] EqualityOperator
src/domain/balances.ts:28:9
 
 function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {
   if (split.mode === 'equal') {
-    if (split.beneficiaries.length === 0) return;
+    if (split.beneficiaries.length !== 0) return;
     const share = amount / split.beneficiaries.length;
     for (const id of split.beneficiaries) {
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected 30 to be close to 20, received difference is 10, but expected 0.000005

[Killed] ArithmeticOperator
src/domain/balances.ts:29:19
 function debitSplit(balances: Balances, amount: number, split: ExpenseSplit): void {
   if (split.mode === 'equal') {
     if (split.beneficiaries.length === 0) return;
-    const share = amount / split.beneficiaries.length;
+    const share = amount * split.beneficiaries.length;
     for (const id of split.beneficiaries) {
       debit(balances, id, share);
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected -60 to be close to 20, received difference is 80, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:30:43
   if (split.mode === 'equal') {
     if (split.beneficiaries.length === 0) return;
     const share = amount / split.beneficiaries.length;
-    for (const id of split.beneficiaries) {
-      debit(balances, id, share);
-    }
+    for (const id of split.beneficiaries) {}
     return;
   }
killedBy: computeBalances split 'equal' cas 2 — payeur inclus comme bénéficiaire : net positif pour lui
statusReason: expected 30 to be close to 20, received difference is 10, but expected 0.000005

[Killed] EqualityOperator
src/domain/balances.ts:36:7
     return;
   }
 
-  if (split.mode === 'weighted') {
+  if (split.mode !== 'weighted') {
     const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
     if (totalWeight === 0) return;
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/domain/balances.ts:36:34
     return;
   }
 
-  if (split.mode === 'weighted') {
-    const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
-    if (totalWeight === 0) return;
-    for (const [id, weight] of Object.entries(split.weights)) {
-      debit(balances, id, (amount * weight) / totalWeight);
-    }
-    return;
-  }
+  if (split.mode === 'weighted') {}
 
   for (const [id, pct] of Object.entries(split.percentages)) {
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: Cannot convert undefined or null to object

[Killed] ArithmeticOperator
src/domain/balances.ts:37:73
   }
 
   if (split.mode === 'weighted') {
-    const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
+    const totalWeight = Object.values(split.weights).reduce((sum, w) => sum - w, 0);
     if (totalWeight === 0) return;
     for (const [id, weight] of Object.entries(split.weights)) {
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: expected 90 to be close to 30, received difference is 60, but expected 0.000005

[Killed] ArrowFunction
src/domain/balances.ts:37:61
   }
 
   if (split.mode === 'weighted') {
-    const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
+    const totalWeight = Object.values(split.weights).reduce(() => undefined, 0);
     if (totalWeight === 0) return;
     for (const [id, weight] of Object.entries(split.weights)) {
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: expected NaN to be close to 30, received difference is NaN, but expected 0.000005

[Killed] EqualityOperator
src/domain/balances.ts:38:9
 
   if (split.mode === 'weighted') {
     const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
-    if (totalWeight === 0) return;
+    if (totalWeight !== 0) return;
     for (const [id, weight] of Object.entries(split.weights)) {
       debit(balances, id, (amount * weight) / totalWeight);
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: expected 60 to be close to 30, received difference is 30, but expected 0.000005

[Killed] ConditionalExpression
src/domain/balances.ts:38:9
 
   if (split.mode === 'weighted') {
     const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
-    if (totalWeight === 0) return;
+    if (false) return;
     for (const [id, weight] of Object.entries(split.weights)) {
       debit(balances, id, (amount * weight) / totalWeight);
killedBy: computeBalances cas limites weighted split avec tous les poids à zéro : aucun débit appliqué
statusReason: expected NaN to be close to 60, received difference is NaN, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:39:63
   if (split.mode === 'weighted') {
     const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
     if (totalWeight === 0) return;
-    for (const [id, weight] of Object.entries(split.weights)) {
-      debit(balances, id, (amount * weight) / totalWeight);
-    }
+    for (const [id, weight] of Object.entries(split.weights)) {}
     return;
   }
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: expected 60 to be close to 30, received difference is 30, but expected 0.000005

[Killed] ArithmeticOperator
src/domain/balances.ts:40:27
     const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
     if (totalWeight === 0) return;
     for (const [id, weight] of Object.entries(split.weights)) {
-      debit(balances, id, (amount * weight) / totalWeight);
+      debit(balances, id, amount * weight * totalWeight);
     }
     return;
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: expected -1020 to be close to 30, received difference is 1050, but expected 0.000005

[Killed] ArithmeticOperator
src/domain/balances.ts:40:28
     const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
     if (totalWeight === 0) return;
     for (const [id, weight] of Object.entries(split.weights)) {
-      debit(balances, id, (amount * weight) / totalWeight);
+      debit(balances, id, (amount / weight) / totalWeight);
     }
     return;
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: expected 56.666666666666664 to be close to 30, received difference is 26.666666666666664, but expected 0.000005

[Killed] BlockStatement
src/domain/balances.ts:45:62
     return;
   }
 
-  for (const [id, pct] of Object.entries(split.percentages)) {
-    debit(balances, id, (amount * pct) / 100);
-  }
+  for (const [id, pct] of Object.entries(split.percentages)) {}
 }
 
killedBy: computeBalances split 'percentage' cas 6 — 100€ entre 3 personnes avec arrondis (33.33 + 33.33 + 33.34)
statusReason: expected 100 to be close to 66.67, received difference is 33.33, but expected 0.05

[Killed] ArithmeticOperator
src/domain/balances.ts:46:26
   }
 
   for (const [id, pct] of Object.entries(split.percentages)) {
-    debit(balances, id, (amount * pct) / 100);
+    debit(balances, id, (amount / pct) / 100);
   }
 }
killedBy: computeBalances split 'percentage' cas 6 — 100€ entre 3 personnes avec arrondis (33.33 + 33.33 + 33.34)
statusReason: expected 99.96999699969997 to be close to 66.67, received difference is 33.29999699969997, but expected 0.05

[Killed] ArithmeticOperator
src/domain/balances.ts:46:25
   }
 
   for (const [id, pct] of Object.entries(split.percentages)) {
-    debit(balances, id, (amount * pct) / 100);
+    debit(balances, id, amount * pct * 100);
   }
 }
killedBy: computeBalances split 'percentage' cas 6 — 100€ entre 3 personnes avec arrondis (33.33 + 33.33 + 33.34)
statusReason: expected -333200 to be close to 66.67, received difference is 333266.67, but expected 0.05
