[Killed] BlockStatement
src/domain/simplify.ts:5:65
 
 const EPSILON = 0.005;
 
-export function simplifyDebts(balances: Balances): Settlement[] {
-  const { credits, debits } = splitBySign(balances);
-  const settlements: Settlement[] = [];
-
-  while (credits.size > 0 && debits.size > 0) {
-    const [creditorId, creditAmount] = findMax(credits);
-    const [debtorId, debtAmount]     = findMax(debits);
-
-    const amount = roundCents(Math.min(creditAmount, debtAmount));
-    settlements.push({ from: debtorId, to: creditorId, amount });
-
-    updateMap(credits, creditorId, creditAmount - amount);
-    updateMap(debits,  debtorId,   debtAmount  - amount);
-  }
-
-  return settlements;
-}
+export function simplifyDebts(balances: Balances): Settlement[] {}
 
 function splitBySign(balances: Balances): {
killedBy: simplifyDebts aucune dette à régler retourne une liste vide pour des soldes vides
statusReason: Target cannot be null or undefined.

[Killed] EqualityOperator
src/domain/simplify.ts:9:10
   const { credits, debits } = splitBySign(balances);
   const settlements: Settlement[] = [];
 
-  while (credits.size > 0 && debits.size > 0) {
+  while (credits.size <= 0 && debits.size > 0) {
     const [creditorId, creditAmount] = findMax(credits);
     const [debtorId, debtAmount]     = findMax(debits);
killedBy: simplifyDebts aucune dette à régler retourne une liste vide quand il n'y a que des débiteurs (aucun créditeur)
statusReason: expected [ { from: 'a', to: '', …(1) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/domain/simplify.ts:9:30
   const { credits, debits } = splitBySign(balances);
   const settlements: Settlement[] = [];
 
-  while (credits.size > 0 && debits.size > 0) {
+  while (credits.size > 0 && debits.size <= 0) {
     const [creditorId, creditAmount] = findMax(credits);
     const [debtorId, debtAmount]     = findMax(debits);
killedBy: simplifyDebts aucune dette à régler retourne une liste vide quand il n'y a que des créditeurs (aucun débiteur)
statusReason: expected [ { from: '', to: 'a', …(1) } ] to have a length of +0 but got 1

[Killed] MethodExpression
src/domain/simplify.ts:13:31
     const [creditorId, creditAmount] = findMax(credits);
     const [debtorId, debtAmount]     = findMax(debits);
 
-    const amount = roundCents(Math.min(creditAmount, debtAmount));
+    const amount = roundCents(Math.max(creditAmount, debtAmount));
     settlements.push({ from: debtorId, to: creditorId, amount });
 
killedBy: simplifyDebts simplification multi-personnes résout 4 personnes avec 2 règlements (un créditeur, deux débiteurs)
statusReason: expected [ { from: 'b', to: 'a', amount: 30 } ] to have a length of 2 but got 1

[Killed] ObjectLiteral
src/domain/simplify.ts:14:22
     const [debtorId, debtAmount]     = findMax(debits);
 
     const amount = roundCents(Math.min(creditAmount, debtAmount));
-    settlements.push({ from: debtorId, to: creditorId, amount });
+    settlements.push({});
 
     updateMap(credits, creditorId, creditAmount - amount);
killedBy: simplifyDebts cas simples (2 personnes) crée un seul règlement pour un créditeur et un débiteur
statusReason: expected {} to deeply equal { from: 'b', to: 'a', amount: 10 }

[Killed] ArithmeticOperator
src/domain/simplify.ts:16:36
     const amount = roundCents(Math.min(creditAmount, debtAmount));
     settlements.push({ from: debtorId, to: creditorId, amount });
 
-    updateMap(credits, creditorId, creditAmount - amount);
+    updateMap(credits, creditorId, creditAmount + amount);
     updateMap(debits,  debtorId,   debtAmount  - amount);
   }
killedBy: simplifyDebts simplification multi-personnes résout 4 personnes avec 2 créditeurs et 2 débiteurs en chaîne (3 règlements)
statusReason: expected [ { from: 'charlie', …(2) }, …(1) ] to have a length of 3 but got 2

[Killed] ArithmeticOperator
src/domain/simplify.ts:17:36
     settlements.push({ from: debtorId, to: creditorId, amount });
 
     updateMap(credits, creditorId, creditAmount - amount);
-    updateMap(debits,  debtorId,   debtAmount  - amount);
+    updateMap(debits,  debtorId,   debtAmount + amount);
   }
 
killedBy: simplifyDebts simplification multi-personnes résout 4 personnes avec 2 règlements (un créditeur, deux débiteurs)
statusReason: expected undefined to deeply equal { from: 'c', to: 'a', amount: 10 }

[Killed] BlockStatement
src/domain/simplify.ts:26:3
 function splitBySign(balances: Balances): {
   credits: Map<string, number>;
   debits:  Map<string, number>;
-} {
-  const credits = new Map<string, number>();
-  const debits  = new Map<string, number>();
-
-  for (const [id, bal] of Object.entries(balances)) {
-    if (bal > EPSILON)  credits.set(id,  bal);
-    if (bal < -EPSILON) debits.set(id, -bal);
-  }
-
-  return { credits, debits };
-}
+} {}
 
 function findMax(map: Map<string, number>): [string, number] {
killedBy: simplifyDebts aucune dette à régler retourne une liste vide pour des soldes vides
statusReason: Cannot destructure property 'credits' of 'splitBySign(...)' as it is undefined.

[Killed] BlockStatement
src/domain/simplify.ts:30:53
   const credits = new Map<string, number>();
   const debits  = new Map<string, number>();
 
-  for (const [id, bal] of Object.entries(balances)) {
-    if (bal > EPSILON)  credits.set(id,  bal);
-    if (bal < -EPSILON) debits.set(id, -bal);
-  }
+  for (const [id, bal] of Object.entries(balances)) {}
 
   return { credits, debits };
killedBy: simplifyDebts cas simples (2 personnes) crée un seul règlement pour un créditeur et un débiteur
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/domain/simplify.ts:31:9
   const debits  = new Map<string, number>();
 
   for (const [id, bal] of Object.entries(balances)) {
-    if (bal > EPSILON)  credits.set(id,  bal);
+    if (false)  credits.set(id,  bal);
     if (bal < -EPSILON) debits.set(id, -bal);
   }
killedBy: simplifyDebts cas simples (2 personnes) crée un seul règlement pour un créditeur et un débiteur
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/domain/simplify.ts:31:9
   const debits  = new Map<string, number>();
 
   for (const [id, bal] of Object.entries(balances)) {
-    if (bal > EPSILON)  credits.set(id,  bal);
+    if (true)  credits.set(id,  bal);
     if (bal < -EPSILON) debits.set(id, -bal);
   }
killedBy: simplifyDebts aucune dette à régler retourne une liste vide quand il n'y a que des débiteurs (aucun créditeur)
statusReason: expected [ …(2) ] to have a length of +0 but got 2

[Killed] UnaryOperator
src/domain/simplify.ts:32:15
 
   for (const [id, bal] of Object.entries(balances)) {
     if (bal > EPSILON)  credits.set(id,  bal);
-    if (bal < -EPSILON) debits.set(id, -bal);
+    if (bal < +EPSILON) debits.set(id, -bal);
   }
 
killedBy: simplifyDebts invariants sur les montants une balance négative entre 0 et -EPSILON est ignorée côté débiteur
statusReason: expected [ { from: 'b', to: 'a', amount: +0 } ] to have a length of +0 but got 1

[Killed] UnaryOperator
src/domain/simplify.ts:32:40
 
   for (const [id, bal] of Object.entries(balances)) {
     if (bal > EPSILON)  credits.set(id,  bal);
-    if (bal < -EPSILON) debits.set(id, -bal);
+    if (bal < -EPSILON) debits.set(id, +bal);
   }
 
killedBy: simplifyDebts cas simples (2 personnes) crée un seul règlement pour un créditeur et un débiteur
statusReason: expected { from: 'b', to: 'a', amount: -10 } to deeply equal { from: 'b', to: 'a', amount: 10 }

[Killed] BlockStatement
src/domain/simplify.ts:38:62
   return { credits, debits };
 }
 
-function findMax(map: Map<string, number>): [string, number] {
-  let maxId  = '';
-  let maxVal = -Infinity;
-
-  for (const [id, val] of map) {
-    if (val > maxVal) { maxVal = val; maxId = id; }
-  }
-
-  return [maxId, maxVal];
-}
+function findMax(map: Map<string, number>): [string, number] {}
 
 function updateMap(map: Map<string, number>, id: string, remaining: number): void {
killedBy: simplifyDebts cas simples (2 personnes) crée un seul règlement pour un créditeur et un débiteur
statusReason: findMax is not a function or its return value is not iterable

[Timeout] UnaryOperator
src/domain/simplify.ts:40:16
 
 function findMax(map: Map<string, number>): [string, number] {
   let maxId  = '';
-  let maxVal = -Infinity;
+  let maxVal = +Infinity;
 
   for (const [id, val] of map) {

[Timeout] BlockStatement
src/domain/simplify.ts:42:32
   let maxId  = '';
   let maxVal = -Infinity;
 
-  for (const [id, val] of map) {
-    if (val > maxVal) { maxVal = val; maxId = id; }
-  }
+  for (const [id, val] of map) {}
 
   return [maxId, maxVal];

[Killed] EqualityOperator
src/domain/simplify.ts:43:9
   let maxVal = -Infinity;
 
   for (const [id, val] of map) {
-    if (val > maxVal) { maxVal = val; maxId = id; }
+    if (val >= maxVal) { maxVal = val; maxId = id; }
   }
 
killedBy: simplifyDebts ordre glouton — sélection à égalité à soldes égaux, le premier créditeur inséré est sélectionné en premier
statusReason: expected 'b' to be 'a' // Object.is equality

[Killed] ConditionalExpression
src/domain/simplify.ts:43:9
   let maxVal = -Infinity;
 
   for (const [id, val] of map) {
-    if (val > maxVal) { maxVal = val; maxId = id; }
+    if (true) { maxVal = val; maxId = id; }
   }
 
killedBy: simplifyDebts ordre glouton — sélection du plus grand en premier apparie le plus gros créditeur en premier
statusReason: expected { from: 'c', to: 'b', amount: 10 } to deeply equal { from: 'c', to: 'a', amount: 30 }

[Timeout] ArrayDeclaration
src/domain/simplify.ts:46:10
     if (val > maxVal) { maxVal = val; maxId = id; }
   }
 
-  return [maxId, maxVal];
+  return [];
 }
 

[Timeout] BlockStatement
src/domain/simplify.ts:49:83
   return [maxId, maxVal];
 }
 
-function updateMap(map: Map<string, number>, id: string, remaining: number): void {
-  if (remaining < EPSILON) map.delete(id);
-  else map.set(id, remaining);
-}
+function updateMap(map: Map<string, number>, id: string, remaining: number): void {}
 
 function roundCents(amount: number): number {

[Killed] ConditionalExpression
src/domain/simplify.ts:50:7
 }
 
 function updateMap(map: Map<string, number>, id: string, remaining: number): void {
-  if (remaining < EPSILON) map.delete(id);
+  if (true) map.delete(id);
   else map.set(id, remaining);
 }
killedBy: simplifyDebts simplification multi-personnes résout 4 personnes avec 2 règlements (un créditeur, deux débiteurs)
statusReason: expected [ { from: 'b', to: 'a', amount: 20 } ] to have a length of 2 but got 1

[Timeout] EqualityOperator
src/domain/simplify.ts:50:7
 }
 
 function updateMap(map: Map<string, number>, id: string, remaining: number): void {
-  if (remaining < EPSILON) map.delete(id);
+  if (remaining >= EPSILON) map.delete(id);
   else map.set(id, remaining);
 }

[Timeout] BlockStatement
src/domain/simplify.ts:54:45
   else map.set(id, remaining);
 }
 
-function roundCents(amount: number): number {
-  return Math.round(amount * 100) / 100;
-}
+function roundCents(amount: number): number {}
 

[Killed] ArithmeticOperator
src/domain/simplify.ts:55:10
 }
 
 function roundCents(amount: number): number {
-  return Math.round(amount * 100) / 100;
+  return Math.round(amount * 100) * 100;
 }
 
killedBy: simplifyDebts cas simples (2 personnes) crée un seul règlement pour un créditeur et un débiteur
statusReason: expected { from: 'b', to: 'a', amount: 100000 } to deeply equal { from: 'b', to: 'a', amount: 10 }

[Timeout] ArithmeticOperator
src/domain/simplify.ts:55:21
 }
 
 function roundCents(amount: number): number {
-  return Math.round(amount * 100) / 100;
+  return Math.round(amount / 100) / 100;
 }
 
