[NoCoverage] BlockStatement
src/domain/expense.service.ts:19:61
     private readonly logger: Logger,
   ) {}
 
-  async create(input: CreateExpenseInput): Promise<Expense> {
-    const expense: Expense = {
-      ...input,
-      id: this.idGen.next(),
-      createdAt: this.clock.now(),
-    };
-
-    await this.repo.save(expense);
-    this.logger.info(`Expense ${expense.id} created`);
-
-    if (expense.amount >= NOTIFICATION_THRESHOLD) {
-      await this.notifier.notifyGroupMembers(
-        expense.groupId,
-        `Nouvelle dépense importante : ${expense.description} (${expense.amount}€)`,
-      );
-    }
-
-    return expense;
-  }
+  async create(input: CreateExpenseInput): Promise<Expense> {}
 }
 

[NoCoverage] EqualityOperator
src/domain/expense.service.ts:29:9
     await this.repo.save(expense);
     this.logger.info(`Expense ${expense.id} created`);
 
-    if (expense.amount >= NOTIFICATION_THRESHOLD) {
+    if (expense.amount > NOTIFICATION_THRESHOLD) {
       await this.notifier.notifyGroupMembers(
         expense.groupId,

[NoCoverage] ConditionalExpression
src/domain/expense.service.ts:29:9
     await this.repo.save(expense);
     this.logger.info(`Expense ${expense.id} created`);
 
-    if (expense.amount >= NOTIFICATION_THRESHOLD) {
+    if (false) {
       await this.notifier.notifyGroupMembers(
         expense.groupId,
