[Killed] ConditionalExpression
src/domain/balances.ts:38:9
 
   if (split.mode === 'weighted') {
     const totalWeight = Object.values(split.weights).reduce((sum, w) => sum + w, 0);
-    if (totalWeight === 0) return;
+    if (true) return;
     for (const [id, weight] of Object.entries(split.weights)) {
       debit(balances, id, (amount * weight) / totalWeight);
killedBy: computeBalances split 'weighted' cas 5 — répartit selon les poids (3:2:1)
statusReason: expected 60 to be close to 30, received difference is 30, but expected 0.000005
