[Killed] ConditionalExpression
src/domain/simplify.ts:32:9
 
   for (const [id, bal] of Object.entries(balances)) {
     if (bal > EPSILON)  credits.set(id,  bal);
-    if (bal < -EPSILON) debits.set(id, -bal);
+    if (false) debits.set(id, -bal);
   }
 
killedBy: simplifyDebts cas simples (2 personnes) crée un seul règlement pour un créditeur et un débiteur
statusReason: expected [] to have a length of 1 but got +0

[Timeout] ConditionalExpression
src/domain/simplify.ts:43:9
   let maxVal = -Infinity;
 
   for (const [id, val] of map) {
-    if (val > maxVal) { maxVal = val; maxId = id; }
+    if (false) { maxVal = val; maxId = id; }
   }
 
